$(document).ready(function() {
    $('.button[filter="wd"]').click(function(){ //відстежуємо натиск на кнопку
        if($(this).attr('val')=='off'){ //перевіряємо, чи кнопка вимкнена, щоб уникнути повторних розгортань
            $('.button[filter]').attr('val','off'); //перемикаємо всі кнопки на значення "вимкнено"
            $(this).attr('val', 'on');//міняємо значення натиснутої кнопки
            $('.filter > div').hide(300);//ховаємо абсолютно всі картки
            $('.filter > div[filter="wd"]').show(300);//показуємо картки із потрібним фільтром
        }
        
    });
    $('.button[filter="ud"]').click(function(){ //відстежуємо натиск на кнопку
        if($(this).attr('val')=='off'){ //перевіряємо, чи кнопка вимкнена, щоб уникнути повторних розгортань
            $('.button[filter]').attr('val','off'); //перемикаємо всі кнопки на значення "вимкнено"
            $(this).attr('val', 'on');//міняємо значення натиснутої кнопки
            $('.filter > div').hide(300);//ховаємо абсолютно всі картки
            $('.filter > div[filter="ud"]').show(300);//показуємо картки із потрібним фільтром
        }
        
    });
    $('.button[filter="moc"]').click(function(){ //відстежуємо натиск на кнопку
        if($(this).attr('val')=='off'){ //перевіряємо, чи кнопка вимкнена, щоб уникнути повторних розгортань
            $('.button[filter]').attr('val','off'); //перемикаємо всі кнопки на значення "вимкнено"
            $(this).attr('val', 'on');//міняємо значення натиснутої кнопки
            $('.filter > div').hide(300);//ховаємо абсолютно всі картки
            $('.filter > div[filter="moc"]').show(300);//показуємо картки із потрібним фільтром
        }
        
    });
    $('.button[filter="all"]').click(function(){ //відстежуємо натиск на кнопку
        if($(this).attr('val')=='off'){ //перевіряємо, чи кнопка вимкнена, щоб уникнути повторних розгортань
            $('.button[filter]').attr('val','off'); //перемикаємо всі кнопки на значення "вимкнено"
            $(this).attr('val', 'on');//міняємо значення натиснутої кнопки
            $('.filter > div').show(300);//показуємо всі картки
        }
        
    });
});